const tnum = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '0'];
const ttitle = ['HKG','MAC','TWN','JPN','KOR','SGP','MOP','USA','GBR','FRA','GER','AUS','AUS','AFG','ALB','ALG','ANG','ARG','ARM','AUT','AZE','BRN','BAN','BLR','BEL','BIZ','BEN','BHU','BOL','BAL','BOT','BRA','BOT','BRU','BUL','BUR','BDI','CAM','CMR','CAN','CPV','CAY','CVL','CHA','CHI','CHN','COL','COM','CON','CRC','CRO','CYP','CZE','DEN','DJI','DOR','ECU','EGY','ESA','GEQ','ERI','EST','ETH','FIJ','FIN','GAB','GAM','GEO','GHA','GRE','GLD','GUA','GUI','GUY','HAI','HON','HUN','ISL','IND','INA','IND','IRI','IRQ','IRL','IRA','ISR','ITA','CIV','IAM','JOR','KAZ','KEN','KUW','KGZ','LAO','LAT','LIB','LES','LBR','LBA','LTU','LUX','MKD','MAD','MAW','MAL','MDV','MLI','MLT','MAU','MRI','MEX','MDA','MON','MGL','MEX','MAR','MOZ','MYA','NAM','NEP','NED','NZL','NCA','NIG','NGR','PRK','NOR','OMA','PAK','PAN','PAR','PER','PHI','POL','POR','PUR','QAT','REU','ROU','RUS','RWA','MSR','KSA','SEN','SRB','SLE','SVK','SLO','SOM','RSA','ESP','SRI','SUD','SUR','SWZ','SWE','SUI','SYR','TJK','TAN','THA','TOG','TGA','TRI','TUN','TUR','TKM','ISV','UGA','UKR','UAE','UAE','URU','UZB','VAC','VEN','VIE','YEM','YUG','ZAM','ZIM','BAN','CZE','Chuncheon','Seoul','Osaka','Tokyo','London','Taipei','Taipei','Los Angeles','San Jose','Silicon Valley','Michigan','Mumbai','Frankfurt','Zurich','Moscow'];
const tcontent = ['香港', '澳门', '台湾', '日本', '韩国', '新加坡', '狮城', '美国', '英国', '法国', '德国', '澳大利亚', '澳洲', '阿富汗', '阿尔巴尼亚', '阿尔及利亚', '安哥拉', '阿根廷', '亚美尼亚', '奥地利', '阿塞拜疆', '巴林', '孟加拉国', '白俄罗斯', '比利时', '伯利兹', '贝宁', '不丹', '玻利维亚', '波斯尼亚和黑塞哥维那', '波黑共和国', '博茨瓦纳', '巴西', '英属维京群岛', '文莱', '保加利亚', '布基纳法索', '布隆迪', '柬埔寨', '喀麦隆', '加拿大', '佛得角', '开曼群岛', '中非共和国', '乍得', '智利', '中国', '哥伦比亚', '科摩罗', '刚果(布)', '刚果(金)', '哥斯达黎加', '克罗地亚', '塞浦路斯', '捷克共和国', '丹麦', '吉布提', '多米尼加共和国', '厄瓜多尔', '埃及', '萨尔瓦多', '赤道几内亚', '厄立特里亚', '爱沙尼亚', '埃塞俄比亚', '斐济', '芬兰', '加蓬', '冈比亚', '格鲁吉亚', '加纳', '希腊', '格陵兰', '危地马拉', '几内亚', '圭亚那', '海地', '洪都拉斯', '匈牙利', '冰岛', '印度', '印度尼西亚', '印尼', '伊朗', '伊拉克', '爱尔兰', '马恩岛', '以色列', '意大利', '科特迪瓦', '牙买加', '约旦', '哈萨克斯坦', '肯尼亚', '科威特', '吉尔吉斯斯坦', '老挝', '拉脱维亚', '黎巴嫩', '莱索托', '利比里亚', '利比亚', '立陶宛', '卢森堡', '马其顿', '马达加斯加', '马拉维', '马来', '马尔代夫', '马里', '马耳他', '毛利塔尼亚', '毛里求斯', '墨西哥', '摩尔多瓦', '摩纳哥', '蒙古', '黑山共和国', '摩洛哥', '莫桑比克', '缅甸', '纳米比亚', '尼泊尔', '荷兰', '新西兰', '尼加拉瓜', '尼日尔', '尼日利亚', '朝鲜', '挪威', '阿曼', '巴基斯坦', '巴拿马', '巴拉圭', '秘鲁', '菲律宾', '波兰', '葡萄牙', '波多黎各', '卡塔尔', '留尼旺', '罗马尼亚', '俄罗斯', '卢旺达', '圣马力诺', '沙特阿拉伯', '塞内加尔', '塞尔维亚', '塞拉利昂', '斯洛伐克', '斯洛文尼亚', '索马里', '南非', '西班牙', '斯里兰卡', '苏丹', '苏里南', '斯威士兰', '瑞典', '瑞士', '叙利亚', '塔吉克斯坦', '坦桑尼亚', '泰国', '多哥', '汤加', '特立尼达和多巴哥', '突尼斯', '土耳其', '土库曼斯坦', '美属维尔京群岛', '乌干达', '乌克兰', '阿拉伯联合酋长国', '阿联酋', '乌拉圭', '乌兹别克斯坦', '梵蒂冈城', '委内瑞拉', '越南', '也门', '南斯拉夫', '扎伊尔', '赞比亚', '津巴布韦', '孟加拉', '捷克','春川','首尔','大坂','东京','伦敦','台北','新北','洛杉矶','圣何塞','硅谷','密歇根','孟买','法兰克福','苏黎世','莫斯科'];

let tnow = new Date();

var tt = {};
for (let i in tnum) {
  tt[tnum[i]] = [ttitle[i], 0];
}

var cc = {};
for (let i in tnum) {
  tt[tnum[i]] = [tcontent[i], 0];
}

let i = tnow.getHours()

$done({
title:tt,
content:cc,
})
